Revit 2024 API
ParameterTypeId.TextStyleItalic Property
 "Italic"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId TextStyleItalic { get; }
Visual Basic
Public Shared ReadOnly Property TextStyleItalic As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ TextStyleItalic {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace